<template>
    <div class="article-details px-20 pt-16 pb-4 flex flex-col overflow-hidden h-full">
        <a class="title p-4 hover:bg-gray-300 hover:rounded-md block" :href="article.link" target="_blank">
            <h1 class=" text-3xl font-bold">{{ article.title }}</h1>
            <p class=" mt-3 text-gray-500">{{ article.feed.title }}</p>
        </a>
        <article class="content p-4 flex-1 overflow-auto" v-html="article.content"/>
    </div>
</template>

<script setup lang="ts">
import { ref } from 'vue'

const article = ref({
    "id": 22,
    "title": "从果香到泥煤：苏格兰威士忌入门指北",
    "link": "https://sspai.com/prime/story/scotch-whisky-101",
    "feed_id": 1,
    "feed": {
      "title": "少数派",
      "tag_id": 0
    },
    "content": "苏格兰作为威士忌生产历史最悠久最有影响力的地区之一，风味极其丰富，是非常适合新手探索的一个产地。<a href=\"https://sspai.com/prime/story/scotch-whisky-101\" target=\"_blank\">查看全文</a><p>本文为会员文章，出自<a href=\"https://sspai.com/prime/precog/single\" target=\"_blank\">《单篇文章》</a >，订阅后可阅读全文。</p >klasjdklfjaklsdjfklasdjkldfjjkasdhgkjadhsjkfdskhfjklasdhjkfhdsjkagfjkasdhfjkhasdjkhfjkl按时艰苦户籍科零点过后就哭了大恢复健康尽快核实的金卡恢复健康是大号艰苦户籍科封杀大家看法户籍卡是德国回家可达十公分尽快更换圣诞节咖啡户籍卡但是和捷克首都和加快速度和捷克首都和就肯定是即可大师史蒂芬就开始大幅和士大夫和技术的开发和第三方即可还是短发就还是短发健康和士大夫艰苦和圣诞节客户分手的借口发生的和士大夫士大夫很舒服的黄金时代发货就开始大幅 会尽快发送的后即可双方的后即可双方的后即可是否后即可第三方 和就开始大幅好看即使对方很快就士大夫很健康的方式后即可乐山大佛后即可发生的后即可发生的按时艰苦户籍科零点过后就哭了大恢复健康尽快核实的金卡恢复健康是大号艰苦户籍科封杀大家看法户籍卡是德国回家可达十公分尽快更换圣诞节咖啡户籍卡但是和捷克首都和加快速度和捷克首都和就肯定是即可大师史蒂芬就开始大幅和士大夫和技术的开发和第三方即可还是短发就还是短发健康和士大夫艰苦和圣诞节客户分手的借口发生的和士大夫士大夫很舒服的黄金时代发货就开始大幅 会尽快发送的后即可双方的后即可双方的后即可是否后即可第三方 和就开始大幅好看即使对方很快就士大夫很健康的方式后即可乐山大佛后即可发生的后即可发生的按时艰苦户籍科零点过后就哭了大恢复健康尽快核实的金卡恢复健康是大号艰苦户籍科封杀大家看法户籍卡是德国回家可达十公分尽快更换圣诞节咖啡户籍卡但是和捷克首都和加快速度和捷克首都和就肯定是即可大师史蒂芬就开始大幅和士大夫和技术的开发和第三方即可还是短发就还是短发健康和士大夫艰苦和圣诞节客户分手的借口发生的和士大夫士大夫很舒服的黄金时代发货就开始大幅 会尽快发送的后即可双方的后即可双方的后即可是否后即可第三方 和就开始大幅好看即使对方很快就士大夫很健康的方式后即可乐山大佛后即可发生的后即可发生的按时艰苦户籍科零点过后就哭了大恢复健康尽快核实的金卡恢复健康是大号艰苦户籍科封杀大家看法户籍卡是德国回家可达十公分尽快更换圣诞节咖啡户籍卡但是和捷克首都和加快速度和捷克首都和就肯定是即可大师史蒂芬就开始大幅和士大夫和技术的开发和第三方即可还是短发就还是短发健康和士大夫艰苦和圣诞节客户分手的借口发生的和士大夫士大夫很舒服的黄金时代发货就开始大幅 会尽快发送的后即可双方的后即可双方的后即可是否后即可第三方 和就开始大幅好看即使对方很快就士大夫很健康的方式后即可乐山大佛后即可发生的后即可发生的按时艰苦户籍科零点过后就哭了大恢复健康尽快核实的金卡恢复健康是大号艰苦户籍科封杀大家看法户籍卡是德国回家可达十公分尽快更换圣诞节咖啡户籍卡但是和捷克首都和加快速度和捷克首都和就肯定是即可大师史蒂芬就开始大幅和士大夫和技术的开发和第三方即可还是短发就还是短发健康和士大夫艰苦和圣诞节客户分手的借口发生的和士大夫士大夫很舒服的黄金时代发货就开始大幅 会尽快发送的后即可双方的后即可双方的后即可是否后即可第三方 和就开始大幅好看即使对方很快就士大夫很健康的方式后即可乐山大佛后即可发生的后即可发生的按时艰苦户籍科零点过后就哭了大恢复健康尽快核实的金卡恢复健康是大号艰苦户籍科封杀大家看法户籍卡是德国回家可达十公分尽快更换圣诞节咖啡户籍卡但是和捷克首都和加快速度和捷克首都和就肯定是即可大师史蒂芬就开始大幅和士大夫和技术的开发和第三方即可还是短发就还是短发健康和士大夫艰苦和圣诞节客户分手的借口发生的和士大夫士大夫很舒服的黄金时代发货就开始大幅 会尽快发送的后即可双方的后即可双方的后即可是否后即可第三方 和就开始大幅好看即使对方很快就士大夫很健康的方式后即可乐山大佛后即可发生的后即可发生的按时艰苦户籍科零点过后就哭了大恢复健康尽快核实的金卡恢复健康是大号艰苦户籍科封杀大家看法户籍卡是德国回家可达十公分尽快更换圣诞节咖啡户籍卡但是和捷克首都和加快速度和捷克首都和就肯定是即可大师史蒂芬就开始大幅和士大夫和技术的开发和第三方即可还是短发就还是短发健康和士大夫艰苦和圣诞节客户分手的借口发生的和士大夫士大夫很舒服的黄金时代发货就开始大幅 会尽快发送的后即可双方的后即可双方的后即可是否后即可第三方 和就开始大幅好看即使对方很快就士大夫很健康的方式后即可乐山大佛后即可发生的后即可发生的按时艰苦户籍科零点过后就哭了大恢复健康尽快核实的金卡恢复健康是大号艰苦户籍科封杀大家看法户籍卡是德国回家可达十公分尽快更换圣诞节咖啡户籍卡但是和捷克首都和加快速度和捷克首都和就肯定是即可大师史蒂芬就开始大幅和士大夫和技术的开发和第三方即可还是短发就还是短发健康和士大夫艰苦和圣诞节客户分手的借口发生的和士大夫士大夫很舒服的黄金时代发货就开始大幅 会尽快发送的后即可双方的后即可双方的后即可是否后即可第三方 和就开始大幅好看即使对方很快就士大夫很健康的方式后即可乐山大佛后即可发生的后即可发生的按时艰苦户籍科零点过后就哭了大恢复健康尽快核实的金卡恢复健康是大号艰苦户籍科封杀大家看法户籍卡是德国回家可达十公分尽快更换圣诞节咖啡户籍卡但是和捷克首都和加快速度和捷克首都和就肯定是即可大师史蒂芬就开始大幅和士大夫和技术的开发和第三方即可还是短发就还是短发健康和士大夫艰苦和圣诞节客户分手的借口发生的和士大夫士大夫很舒服的黄金时代发货就开始大幅 会尽快发送的后即可双方的后即可双方的后即可是否后即可第三方 和就开始大幅好看即使对方很快就士大夫很健康的方式后即可乐山大佛后即可发生的后即可发生的按时艰苦户籍科零点过后就哭了大恢复健康尽快核实的金卡恢复健康是大号艰苦户籍科封杀大家看法户籍卡是德国回家可达十公分尽快更换圣诞节咖啡户籍卡但是和捷克首都和加快速度和捷克首都和就肯定是即可大师史蒂芬就开始大幅和士大夫和技术的开发和第三方即可还是短发就还是短发健康和士大夫艰苦和圣诞节客户分手的借口发生的和士大夫士大夫很舒服的黄金时代发货就开始大幅 会尽快发送的后即可双方的后即可双方的后即可是否后即可第三方 和就开始大幅好看即使对方很快就士大夫很健康的方式后即可乐山大佛后即可发生的后即可发生的按时艰苦户籍科零点过后就哭了大恢复健康尽快核实的金卡恢复健康是大号艰苦户籍科封杀大家看法户籍卡是德国回家可达十公分尽快更换圣诞节咖啡户籍卡但是和捷克首都和加快速度和捷克首都和就肯定是即可大师史蒂芬就开始大幅和士大夫和技术的开发和第三方即可还是短发就还是短发健康和士大夫艰苦和圣诞节客户分手的借口发生的和士大夫士大夫很舒服的黄金时代发货就开始大幅 会尽快发送的后即可双方的后即可双方的后即可是否后即可第三方 和就开始大幅好看即使对方很快就士大夫很健康的方式后即可乐山大佛后即可发生的后即可发生的",
    "statuses": [
      {
        "user_id": 2,
        "is_read": true,
        "is_favorited": true
      }
    ]
  })
</script>